Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
}

/* USER CODE BEGIN Header_StartTaskRTC */
/**
  * @brief  Function implementing the TaskRTC thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartTaskRTC */
void StartTaskRTC(void *argument)
{
  /* USER CODE BEGIN StartTaskRTC */
	extern RTC_HandleTypeDef hrtc;
	 	 RTC_TimeTypeDef _RTCTime, _AlarmPeriod;
	 	 RTC_DateTypeDef _RTCDate;
	 	 RTC_AlarmTypeDef _AlarmON, _AlarmOFF;


	 	uint8_t _PumpDispensing = 1;





	 	_AlarmPeriod.Hours = 1;
	 	_AlarmPeriod.Minutes = 0;
	 	_AlarmPeriod.Seconds = 0;

	 	 _AlarmON.AlarmTime.Hours = 8 ;
	 	 _AlarmON.AlarmTime.Minutes = 0 ;
	 	_AlarmON.AlarmTime.Seconds = 0 ;


		 _AlarmOFF.AlarmTime.Hours = 8 ;
		 _AlarmOFF.AlarmTime.Minutes = 1 ;
		_AlarmOFF.AlarmTime.Seconds = 0 ;




	 	HAL_RTC_Init(&hrtc);
		HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
		HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

		HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
		HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);

	// 	_RTCTime.Hours = 0x0;
	//    _RTCTime.Minutes =0x0;
	//	_RTCTime.Seconds =0x0;
	// 	HAL_RTC_SetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	// 	HAL_RTC_SetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

		osMessageQueuePut(QueueAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	 	osTimerStart(TimerRTCHandle, 100);
	 	uint32_t tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  //	  osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 10);
	  //	  osMessageQueuePut(QueueAlarmHandle, &_AlarmPeriod, 0, 10);

	  	  HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	  	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

	  	if (osOK == osSemaphoreAcquire(BinarySemCounterHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	  		_AlarmOFF.AlarmTime.Minutes = _PumpDispensing;

	  	}


	  ////	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 10);
	  //	  if(osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  //		{
	  //
	  //		  	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 100);
	  //		  	  osMessageQueueGet(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 100);
	  //			  _AlarmOFF.AlarmTime.Minutes = _PumpOperatingTime.Minutes;
	  //			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  //		}



	  	   if (_AlarmON.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmON.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		  osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_SET);
	  			  osThreadFlagsSet(TaskPumpONHandle, 0x00000001U);
	  			  _AlarmON.AlarmTime.Hours = _AlarmON.AlarmTime.Hours + 1;

	  			  if(_AlarmON.AlarmTime.Hours == 24)
	  				  {
	  					  _AlarmON.AlarmTime.Hours = 8;
	  				  }
	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);
	  	  	  }
	  	  else if(_AlarmOFF.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmOFF.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		  	  osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_RESET);
	  			  osThreadFlagsSet(TaskPumpOFFHandle, 0x00000010U);

	  			  _AlarmOFF.AlarmTime.Hours = _AlarmOFF.AlarmTime.Hours + 1;
	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);

	  	  	  }



	  //	  if(RTCTime.Seconds != CompareSeconds)
	  //	  {
	  //
	  //
	  //		  CompareSeconds = RTCTime.Seconds;
	  //	  }
	  	  if (osOK == osSemaphoreAcquire(BinarySemRTCHandle, 0)) {
	  //	  	  			osMessageQueuePut(QueueRTCDataHandle, &_RTCDate, 0, osWaitForever);
	  	  	  			osMessageQueuePut(QueueRTCTimeHandle, &_RTCTime, 0, osWaitForever);
	  	  	  		}

	  	  tick4 += ((70 * osKernelGetTickFreq()) / 1000);
	  	  osDelayUntil(tick4);

  }
  /* USER CODE END StartTaskRTC */
}

/* USER CODE BEGIN Header_StartTaskBme280 */
/**
* @brief Function implementing the TaskBme280 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBme280 */
void StartTaskBme280(void *argument)
{
  /* USER CODE BEGIN StartTaskBme280 */
	BmeData_t _BmeData;
		uint32_t tick3;
		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BME280_Init(&hi2c1, BME280_TEMPERATURE_16BIT, BME280_PRESSURE_ULTRALOWPOWER,
		BME280_HUMINIDITY_STANDARD, BME280_NORMALMODE);
		BME280_SetConfig(BME280_STANDBY_MS_10, BME280_FILTER_OFF);
		osMutexRelease(MutexI2CHandle);
		osTimerStart(TimerBmeDataHandle, 100);

		tick3 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  	  BME280_ReadTemperatureAndPressureAndHuminidity(&_BmeData.Temperature,
	  	  				&_BmeData.Pressure, &_BmeData.Humidity);
	  	  osMutexRelease(MutexI2CHandle);

	  	  if (osOK == osSemaphoreAcquire(BinarySemBme280Handle, 0)) {
	  	  			osMessageQueuePut(QueueBmeHandle, &_BmeData, 0, osWaitForever);
	  	  		}
	  		printf("TASK BME280 \n\r ");
	  //	  printf("Temperature: %.2f, Humidity: %.2f z \n\r", _BmeData.Temperature, _BmeData.Humidity);
	  //////    osDelay(100);
	  		tick3 += (75 * osKernelGetTickFreq()) / 1000;
	  		osDelayUntil(tick3);
  }
  /* USER CODE END StartTaskBme280 */
}

/* USER CODE BEGIN Header_StartTaskBH1750 */
/**
* @brief Function implementing the TaskBH1750 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBH1750 */
void StartTaskBH1750(void *argument)
{
  /* USER CODE BEGIN StartTaskBH1750 */
	uint32_t tick4;
		BHData_t _BHData;

		//	float BH1750_lux;

		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BH1750_Init(&hi2c1);
		BH1750_SetMode(CONTINUOUS_HIGH_RES_MODE_2);
		osMutexRelease(MutexI2CHandle);

		osTimerStart(TimerBh1750DataHandle, 100);
		tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  osMutexAcquire(MutexI2CHandle, osWaitForever);

	 	  		BH1750_ReadLight(&_BHData.LightIntensity);
	 	  //	  	  printf("Light: %.2f \n\r", _BhData.LightIntensity);
	 	  		osMutexRelease(MutexI2CHandle);

	 	  		if (osOK == osSemaphoreAcquire(BinarySemBH1750Handle, 0)) {
	 	  			osMessageQueuePut(QueueBh1750Handle, &_BHData, 0, osWaitForever);
	 	  		}
	 	  //	  	 	  if(BH1750_OK == BH1750_ReadLight(&BH1750_lux))
	 	  //	  	 	  	  {
	 	  //	  	 	  		  size = sprintf(buffer, "BH1750 Lux: %.2f\n\r", BH1750_lux);
	 	  //	  	 	  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)buffer, size, 100);
	 	  //	  	 	  	  }
	 	  		printf("TASK BH1750 \n\r ");
	 	  		tick4 += ((65 * osKernelGetTickFreq()) / 1000);
	 	  		osDelayUntil(tick4);
  }
  /* USER CODE END StartTaskBH1750 */
}

/* USER CODE BEGIN Header_StartTaskSSD1306 */
/**
* @brief Function implementing the TaskSSD1306 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSSD1306 */
void StartTaskSSD1306(void *argument)
{
  /* USER CODE BEGIN StartTaskSSD1306 */

