Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	char MessageTemp[32], MessageHum[32];
	char MessageInten[32];
	char MessageTime[32];
	char MessageTimePump[32];
	char MessageFreqAlarm[32];




	BmeData_t _BmeData;
	BHData_t _BHData;
	RTC_TimeTypeDef _RTCTime;
	RTC_TimeTypeDef _AlarmPeriod;
	RTC_TimeTypeDef _PumpOperatingTime;
	uint8_t _PumpDispensing = 1;
	Alarm_Freq Update_Alarm;

	uint32_t tick2;


	osMutexAcquire(MutexI2C2Handle, osWaitForever);
	SSD1306_Init(&hi2c1);
	osMutexRelease(MutexI2C2Handle);

	GFX_SetFont(font_8x5);
	SSD1306_Clear(BLACK);
	SSD1306_Display();

	tick2 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  	  SSD1306_Clear(BLACK);
	  	  osMessageQueueGet(QueueBmeHandle, &_BmeData, 0, 50);
	  	  osMessageQueueGet(QueueBh1750Handle, &_BHData, 0, 50);
	  //	  osMessageQueueGet(QueueRTCDataHandle, &_RTCDate, 0,osWaitForever);
	  	  osMessageQueueGet(QueueRTCTimeHandle, &_RTCTime, 0, 50);



	  	  if(osOK== osMessageQueueGet(QueueCounterPumpHandle, &_PumpDispensing, 0, 50))
	  	  {
	  		  osSemaphoreRelease(BinarySemCounterHandle);
	  		  osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	  	  }

	  	   osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, 50);


//	  	   osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, osWaitForever);


	  	  sprintf(MessageTemp, "Temperature: %.2f ", _BmeData.Temperature);
	  	  sprintf(MessageHum, "Humidity: %.2f", _BmeData.Humidity);
	  	  sprintf(MessageInten, "Lx: %.2f,", _BHData.LightIntensity);
	  //	  sprintf(MessageData, "Data: %02d.%02d.20%02d  Time: %02d:%02d:%02d:%02d",_RTCDate.Date,_RTCDate.Month,_RTCDate.Year,_RTCTime.Hours,_RTCTime.Minutes,_RTCTime.Seconds);
	  	  sprintf(MessageTime, "Time: %02d:%02d:%02d",_RTCTime.Hours,_RTCTime.Minutes,_RTCTime.Seconds);
	  	  sprintf(MessageTimePump, "Pump OP Time: %02d Min",_PumpDispensing);
	  	  sprintf(MessageFreqAlarm, "Alarm Period: %02d H", _AlarmPeriod.Hours);

	  	  GFX_DrawString(0, 0, MessageTime, WHITE, 0);
	  	  GFX_DrawString(0, 10, MessageTemp, WHITE, 0);
	  	  GFX_DrawString(0, 20, MessageHum, WHITE, 0);
	  	  GFX_DrawString(0, 30, MessageInten, WHITE, 0);
	  	  GFX_DrawString(0, 40, MessageTimePump, WHITE, 0);
	  	  GFX_DrawString(0, 50, MessageFreqAlarm, WHITE, 0);

	  	  SSD1306_Display();

	  	  printf("TASK OLED \n\r");

	  //		printf("TASK OLED I2C MUTEX is released \n\r");
	        tick2 += (100 * osKernelGetTickFreq()) / 1000;
	  	  osDelayUntil(tick2);
  }
  /* USER CODE END StartTaskSSD1306 */
}

/* USER CODE BEGIN Header_StartTaskPumpON */
/**
* @brief Function implementing the TaskPumpON thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpON */
void StartTaskPumpON(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpON */
	drv8835_init();
  /* Infinite loop */
  for(;;)
  {

	  osThreadFlagsWait(0x00000001U, osFlagsWaitAny, osWaitForever);

	  drv8835_set_motorA_speed(99);
	  osThreadFlagsClear(0x00000001U);
  }
  /* USER CODE END StartTaskPumpON */
}

/* USER CODE BEGIN Header_StartTaskPumpOFF */
/**
* @brief Function implementing the TaskPumpOFF thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpOFF */
void StartTaskPumpOFF(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpOFF */
  /* Infinite loop */
  for(;;)
  {
	  osThreadFlagsWait(0x00000010U, osFlagsWaitAny, osWaitForever);


	  	  drv8835_set_motorA_speed(0);

  }
  /* USER CODE END StartTaskPumpOFF */
}

/* USER CODE BEGIN Header_StartTaskCounterPump */
/**
* @brief Function implementing the TaskCounterPump thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskCounterPump */
void StartTaskCounterPump(void *argument)
{
  /* USER CODE BEGIN StartTaskCounterPump */
	static uint8_t _PumpDipensing = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)== GPIO_PIN_RESET)
	 	  {
	 	  	  _PumpDipensing= _PumpDipensing + 1;
	 	  		if(_PumpDipensing >=60)
	 	  		{
	 	  			_PumpDipensing = 1;
	 	  		}
	 	  		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 0);
	 	  }
	 	  else if(HAL_GPIO_ReadPin(B2_GPIO_Port, B2_Pin)== GPIO_PIN_RESET)
	 	  {
	 		  _PumpDipensing= _PumpDipensing -1;
	 		 	  		if(_PumpDipensing <=0)
	 		 	  		{
	 		 	  			_PumpDipensing = 59;
	 		 	  		}
	 		   osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 0);
	 	  }

	 	  	  	tick += (420 * osKernelGetTickFreq()) / 1000;
	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskCounterPump */
}

/* USER CODE BEGIN Header_StartTaskAlarmCounter */
/**
* @brief Function implementing the TaskAlarmCounte thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskAlarmCounter */
void StartTaskAlarmCounter(void *argument)
{
  /* USER CODE BEGIN StartTaskAlarmCounter */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END StartTaskAlarmCounter */
}

/* CallbackTimerBmeData function */
void CallbackTimerBmeData(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBmeData */
	osSemaphoreRelease(BinarySemBme280Handle);
  /* USER CODE END CallbackTimerBmeData */
}

/* CallbackTimerBh1750Data function */
void CallbackTimerBh1750Data(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBh1750Data */
	osSemaphoreRelease(BinarySemBH1750Handle);
  /* USER CODE END CallbackTimerBh1750Data */
}

/* CallbackTimerRTC function */
void CallbackTimerRTC(void *argument)
{
  /* USER CODE BEGIN CallbackTimerRTC */
	osSemaphoreRelease(BinarySemRTCHandle);
  /* USER CODE END CallbackTimerRTC */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

//void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
//{
//	static uint8_t _PumpDipensing = 1;
//
//
//
//	if(GPIO_Pin == B1_Pin)
//	{
//
//		_PumpDipensing= _PumpDipensing + 1;
//		if(_PumpDipensing >=60)
//		{
//			_PumpDipensing = 1;
//		}
//		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 0);
//
//
//
////		osThreadFlagsSet(TaskAlarmCountUHandle, 0x00010000U);
//
//	}
//
//}

void _putchar(char character) {
	// send char to console etc.
	osMutexAcquire(MutexPrintfHandle, osWaitForever);
	HAL_UART_Transmit(&huart2, (uint8_t*)&character, 1, 1000);

	osMutexRelease(MutexPrintfHandle);
}

/* USER CODE END Application */

